{"keys":[{"path":["title"],"id":"title","weight":1,"src":"title","getFn":null},{"path":["body"],"id":"body","weight":1,"src":"body","getFn":null}],"records":[{"i":0,"$":{"0":{"v":"This page has not yet sprouted","n":0.408},"1":{"v":"[Dendron](https://dendron.so/) (the tool used to generate this site) lets authors selective publish content. You will see this page whenever you click on a link to an unpublished page\n\n![](https://foundation-prod-assetspublic53c57cce-8cpvgjldwysl.s3-us-west-2.amazonaws.com/assets/images/not-sprouted.png)","n":0.189}}},{"i":1,"$":{"0":{"v":"Home","n":1},"1":{"v":"\n# Welcome!\n\nThis is the home of my published notes on the web!\n\nChoose your subject of interest:\n1. [[compbio]]","n":0.243}}},{"i":2,"$":{"0":{"v":"Computational Biology","n":0.707},"1":{"v":"### Definition\nComputational biology happens at the intersection of maths, computers, and biology!\n\nComputational Biology is a field of study that seeks to build models of biological systems using computational techniques.\n\n## Intersecting Areas\nSince computational biology derives from multiple disciplines, it can seem to be similar to some other fields which also derive from those same disciplines. However, it is a different field from:\n1. *Bioinformatics*: Bioinformatics as a field tries to build systems to efficiently store, label, and retrieve biological data.\n2. *Biological Computing*: Biological Computing as a field focuses on building computer from biological entities.\n\n> You can think of bioinformatics as the analogue to databases and data structures from computer science, and computational biology to be analogous to Algorithms.\n\n## Subfields\nComputational Biology is a broad discipline and encompasses various focus areas:\n1. ***Computational Anatomy*** studies anatomy at tissue and organ subunit scales through  computational methods.\n2. ***Mathematical Biology*** uses mathematical models to examine systems in living organisms.\n3. ***Computational Biomodeling*** build computer models and simulations of biological systems.\n4. ***Systems Biology*** refers to modeling biological systems and their interactions to understand properties that emerge bottom-up.\n5. ***Computational Phylogenetics*** tries to reconstruct the phylogeny from DNA.\n6. ***Population Genetics*** focuses on using DNA to understand populations and their history.\n7. ***Computational Genomics*** studies cellular and organismal genomes through computational methods.\n8. ***Computational Neuroscience*** studies brain function and the nervous systems through the lens of information.\n9. ***Computational Neuropsychiatry*** uses modeling to study brain mechanisms of mental disorders.\n10. ***Computational Pharmacology*** studies the inter-relation of genotypes, diseases, and drugs.\n11. ***Computational Oncology*** studies cancer through algorithmic approaches.\n","n":0.063}}}]}
